# написати анонімну функцію яка приймає 2 значення x,y
#  де:
# y за замовчуванням = числу що більше за 0.
#  x та y - катеты прямокутного трикуника у сантиметрах.
# Результат роботи функції – значення гіпотенузи цього трикутника.

# Використовуючи функцію map отримати список чисел, які були створені в результаті застосування лямбда функції
# до кожного елемента ітеруємого(мих) об'єкта(ів) який(і) ви можете створити як заманеться.
#
#   Для перевірки навести 2 тестових приклади у консоль:
#
# коли передається один список/послідовність чисел для обробки у map
# коли передається 2 списки/послідовності чисел для обробки у map

import math

a = 2
a_list = [2, 4, 6, 8]
b_list = [3, 5, 7, 9]

c_1 = list(map(lambda b: round(math.sqrt(a**2 + b**2), 2), b_list))
print(f"Here is a list of hypotenuses using only one parameter 'a' and a list of 'b': \n{c_1}")

print()

c_2 = list(map(lambda a1, b: round(math.sqrt(a1**2 + b**2), 2), a_list, b_list))
print(f"Here is a list of hypotenuses using lists of parameters 'a' and 'b': \n{c_2}")


