# Дано текст:
# “Любіть Україну, як сонце, любіть,
# як вітер, і трави, і води…
# В годину щасливу і в радості мить,
# любіть у годину негоди.
# Любіть Україну у сні й наяву,
# вишневу свою Україну,
# красу її, вічно живу і нову,
# і мову її солов’їну.
# Між братніх народів, мов садом рясним,
# сіяє вона над віками…
# Любіть Україну всім серцем своїм
# і всіми своїми ділами.
# Для нас вона в світі єдина, одна
# в просторів солодкому чарі…
# Вона у зірках, і у вербах вона,
# і в кожному серця ударі,
# у квітці, в пташині, в електровогнях,
# у пісні у кожній, у думі,
# в дитячий усмішці, в дівочих очах
# і в стягів багряному шумі…”
#
# Створіть з цього тексту словник де ключем обо значенням буде слово (як вам зручніше) з тексту.
# А значенням або ключем буде ціле число що характеризує скількі разів слово зустрілось у тексті.
# (Памятайте що у текстіі є розділові знаки - їх потрібно позбутися спочатку.).
# Було б коректно усі літери перевести до одного з регістрів (усі маеленьк літери чи усі великі)  до того як розпочати підрахунок слів.
#
# Виведіть 2 значення:
#  - яке слово і скільки разів зусрічається найбільше?
#  - яке слово і скільки разів зусрічається найменше? (опціонально)

poem = (
    "Любіть Україну, як сонце, любіть,"
    "як вітер, і трави, і води…"
    "В годину щасливу і в радості мить,"
    "любіть у годину негоди."
    "Любіть Україну у сні й наяву,"
    "вишневу свою Україну,"
    "красу її, вічно живу і нову,"
    "і мову її солов’їну."
    "Між братніх народів, мов садом рясним,"
    "сіяє вона над віками…"
    "Любіть Україну всім серцем своїм"
    "і всіми своїми ділами."
    "Для нас вона в світі єдина, одна"
    "в просторів солодкому чарі…"
    "Вона у зірках, і у вербах вона,"
    "і в кожному серця ударі,"
    "у квітці, в пташині, в електровогнях,"
    "у пісні у кожній, у думі,"
    "в дитячий усмішці, в дівочих очах"
    "і в стягів багряному шумі…".lower()
)


poem = poem.replace(",", " ")
poem = poem.replace("…", " ")
poem = poem.replace(".", " ")
poem = poem.replace("  ", " ")
poem = poem.split()

my_dict = {i: poem.count(i) for i in poem}

popular_word = ""
popular_word_count = 0
unpopular_word = ""
unpopular_word_count = 1

for key in my_dict:
    if my_dict[key] > popular_word_count:
        popular_word = key
        popular_word_count = my_dict[key]

print(
    f"The most popular word is {popular_word}, it is being represented {popular_word_count} times in a poem"
)

for key in my_dict:
    if my_dict[key] <= unpopular_word_count:
        unpopular_word = key
        unpopular_word_count = my_dict[key]

print(
    f"One of the most unpopular words is {unpopular_word}, it is being represented {unpopular_word_count} times in a poem"
)
