# Валентина прогуляла лекцію з математики.
# Викладач вирішив пожартувати з недбалої студентки і попросив її на практичному занятті перерахувати всі позитивні дільники деяких цілих чисел.
# Для нескладних прикладів студентка швидко знайшла рішення (для числа 6 це: 1, 2, 3, 6;
# а для числа 16 це: 1, 2, 4, 8, 16), але цим все не закінчилося.
# На домашнє завдання їй дали більш складні варіанти: 23436, 190187200, 380457890232.
#
# Вирішити таке вручну, як ви знаєте, фактично неможливо. Ото Валентина і звернулася до вас за допомогою.
# Допоможіть їй (за допомогою функції all_divisors(number)). Постарайтеся знайти найоптимальніше рішення.
#
# Результат подайте у вигляді списку (не забудьте що числа мають бути подані в результуючому списку за зростанням).
#
# number - завжди має бути більшим за 0 - інакше повинен бути згнерований в результаті пустий список


def all_divisors(number):
    divisors = []
    if number > 1:
        for n in range(1, number + 1):
            if number % n == 0:
                divisors.append(n)
    return divisors


print(all_divisors(0))

