# На дошці 8х8 стоять 8 ферзей.
# Вводяться координати всіх ферзей і потрібно визначити, чи є серед них пара, що б'ють один одного.
# Якщо жодна пара ферз не б'є один одного, то виводиться False.
# coords - список координанат де кожна координата являє собою кортеж з 2 цифер від 0 до 7,
# що і слугуть координатими кролеви на дошці приклад coords: [ (2, 4), (3, 6) , (4, 7), (5, 1), (6, 2), (7, 3), (1, 7) ]
# функція повертає True, Flase

def chess_queens(coords):
    status = True



    return status


chess_queens([(2, 4), (3, 6), (4, 7), (5, 1), (6, 2), (7, 3), (1, 7)])

